InformationRegisters/ПрайсЛистыКонтрагентовСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовСкидки</Name>
			<Comment>Скидки на прайс-листы контрагентов</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТегПозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовСкидки/Ext/ManagerModule.bsl
// Модуль менеджера регистра сведений "Прайс-листы контрагентов скидки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДополнитьСкидкамиПрайЛиста(ПрайсЛист, ТегиПроизводители, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТегиИПроизводители.ПрайсЛист КАК ПрайсЛист,
	|	ТегиИПроизводители.ТегПозиции КАК ТегПозиции,
	|	ТегиИПроизводители.Производитель КАК Производитель
	|ПОМЕСТИТЬ ВТ_ТегиИПроизводители
	|ИЗ
	|	&ТегиИПроизводители КАК ТегиИПроизводители
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТегПозиции,
	|	Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовСкидкиСрезПоследних.ТегПозиции КАК ТегПозиции,
	|	ПрайсЛистыКонтрагентовСкидкиСрезПоследних.Производитель КАК Производитель,
	|	ПрайсЛистыКонтрагентовСкидкиСрезПоследних.Скидка КАК СтарыйПроцент
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
	|			&НаДату,
	|			ПрайсЛист = &ПрайсЛист
	|				И (ТегПозиции, Производитель) В
	|					(ВЫБРАТЬ
	|						ВТ_ТегиИПроизводители.ТегПозиции,
	|						ВТ_ТегиИПроизводители.Производитель
	|					ИЗ
	|						ВТ_ТегиИПроизводители КАК ВТ_ТегиИПроизводители)) КАК ПрайсЛистыКонтрагентовСкидкиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТегПозиции,
	|	Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТегиИПроизводители.ПрайсЛист,
	|	ВТ_ТегиИПроизводители.ТегПозиции,
	|	ВТ_ТегиИПроизводители.Производитель,
	|	ЕСТЬNULL(Цены.СтарыйПроцент, 0) КАК СтарыйПроцент
	|ИЗ
	|	ВТ_ТегиИПроизводители КАК ВТ_ТегиИПроизводители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО ВТ_ТегиИПроизводители.ТегПозиции = Цены.ТегПозиции
	|			И ВТ_ТегиИПроизводители.Производитель = Цены.Производитель";
	
	Запрос.УстановитьПараметр("ТегиИПроизводители" , ТегиПроизводители);
	Запрос.УстановитьПараметр("НаДату"             , НаДату);
	Запрос.УстановитьПараметр("ПрайсЛист"          , ПрайсЛист);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
